app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---

<div> This is the user(using current.user.first_name) : <%=Current.user.first_name%> </div>