app/controllers/posts_controller.rb

 def create
    @post = Post.new(post_params)
    #@post.user_id =  Current.user.id
    #@post.image.attach(params[:image])
    #@post.image.attach(io: File.open("/path/to/file.jpg"), filename: "pic.jpg", content_type: "image/jpg")
    @post.save
---
INSERT INTO "posts" ("message", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "you"], ["created_at", "2021-10-18 00:23:24.260046"], ["updated_at", "2021-10-18 00:23:24.260046"], ["user_id", 5]]